<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>Name Server Configuration</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REL="HOME"
TITLE="BIND 9 Administrator Reference Manual"
HREF="Bv9ARM.html"><LINK
REL="PREVIOUS"
TITLE="BIND Resource Requirements"
HREF="Bv9ARM.ch02.html"><LINK
REL="NEXT"
TITLE="Advanced DNS Features"
HREF="Bv9ARM.ch04.html"></HEAD
><BODY
CLASS="chapter"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>BIND 9 Administrator Reference Manual</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="Bv9ARM.ch02.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="Bv9ARM.ch04.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="chapter"
><H1
><A
NAME="ch03"
></A
>Chapter 3. Name Server Configuration</H1
><DIV
CLASS="TOC"
><DL
><DT
><B
>Table of Contents</B
></DT
><DT
>3.1. <A
HREF="Bv9ARM.ch03.html#sample_configuration"
>Sample Configurations</A
></DT
><DT
>3.2. <A
HREF="Bv9ARM.ch03.html#AEN268"
>Load Balancing</A
></DT
><DT
>3.3. <A
HREF="Bv9ARM.ch03.html#AEN345"
>Name Server Operations</A
></DT
></DL
></DIV
><P
>In this section we provide some suggested configurations along
with guidelines for their use. We also address the topic of reasonable
option setting.</P
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="sample_configuration"
>3.1. Sample Configurations</A
></H1
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="AEN257"
>3.1.1. A Caching-only Name Server</A
></H2
><P
>The following sample configuration is appropriate for a caching-only
name server for use by clients internal to a corporation.  All queries
from outside clients are refused using the <B
CLASS="command"
>allow-query</B
>
option.  Alternatively, the same effect could be achieved using suitable
firewall rules.</P
><PRE
CLASS="programlisting"
>&#13;// Two corporate subnets we wish to allow queries from.
acl corpnets { 192.168.4.0/24; 192.168.7.0/24; };
options {
     directory "/etc/namedb";           // Working directory
     allow-query { corpnets; };
};
// Provide a reverse mapping for the loopback address 127.0.0.1
zone "0.0.127.in-addr.arpa" {
     type master;
     file "localhost.rev";
     notify no;
};
</PRE
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="AEN262"
>3.1.2. An Authoritative-only Name Server</A
></H2
><P
>This sample configuration is for an authoritative-only server
that is the master server for "<TT
CLASS="filename"
>example.com</TT
>"
and a slave for the subdomain "<TT
CLASS="filename"
>eng.example.com</TT
>".</P
><PRE
CLASS="programlisting"
>&#13;options {
     directory "/etc/namedb";           // Working directory
     allow-query { any; };              // This is the default
     recursion no;                      // Do not provide recursive service
};

// Provide a reverse mapping for the loopback address 127.0.0.1
zone "0.0.127.in-addr.arpa" {
     type master;
     file "localhost.rev";
     notify no;
};
// We are the master server for example.com
zone "example.com" {
     type master;
     file "example.com.db";
     // IP addresses of slave servers allowed to transfer example.com
     allow-transfer {
          192.168.4.14;
          192.168.5.53;
     };
};
// We are a slave server for eng.example.com
zone "eng.example.com" {
     type slave;
     file "eng.example.com.bk";
     // IP address of eng.example.com master server
     masters { 192.168.4.12; };
};
</PRE
></DIV
></DIV
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="AEN268"
>3.2. Load Balancing</A
></H1
><P
>A primitive form of load balancing can be achieved in
the <ACRONYM
CLASS="acronym"
>DNS</ACRONYM
> by using multiple A records for one name.</P
><P
>For example, if you have three WWW servers with network addresses
of 10.0.0.1, 10.0.0.2 and 10.0.0.3, a set of records such as the
following means that clients will connect to each machine one third
of the time:</P
><DIV
CLASS="informaltable"
><P
></P
><A
NAME="AEN273"
></A
><TABLE
CELLPADDING="3"
BORDER="1"
CLASS="CALSTABLE"
><TBODY
><TR
><TD
><P
>Name</P
></TD
><TD
><P
>TTL</P
></TD
><TD
><P
>CLASS</P
></TD
><TD
><P
>TYPE</P
></TD
><TD
><P
>Resource Record (RR) Data</P
></TD
></TR
><TR
><TD
><P
><VAR
CLASS="literal"
>www</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>600</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>IN</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>A</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>10.0.0.1</VAR
></P
></TD
></TR
><TR
><TD
><P
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>600</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>IN</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>A</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>10.0.0.2</VAR
></P
></TD
></TR
><TR
><TD
><P
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>600</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>IN</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>A</VAR
></P
></TD
><TD
><P
><VAR
CLASS="literal"
>10.0.0.3</VAR
></P
></TD
></TR
></TBODY
></TABLE
><P
></P
></DIV
><P
>When a resolver queries for these records, <ACRONYM
CLASS="acronym"
>BIND</ACRONYM
> will rotate
    them and respond to the query with the records in a different
    order.  In the example above, clients will randomly receive
    records in the order 1, 2, 3; 2, 3, 1; and 3, 1, 2. Most clients
    will use the first record returned and discard the rest.</P
><P
>For more detail on ordering responses, check the
    <B
CLASS="command"
>rrset-order</B
> substatement in the
    <B
CLASS="command"
>options</B
> statement, see
    <A
HREF="Bv9ARM.ch06.html#rrset_ordering"
><I
>RRset Ordering</I
></A
>.
    This substatement is not supported in
    <ACRONYM
CLASS="acronym"
>BIND</ACRONYM
> 9, and only the ordering scheme described above is
    available.</P
></DIV
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="AEN345"
>3.3. Name Server Operations</A
></H1
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="AEN347"
>3.3.1. Tools for Use With the Name Server Daemon</A
></H2
><P
>There are several indispensable diagnostic, administrative
and monitoring tools available to the system administrator for controlling
and debugging the name server daemon. We describe several in this
section </P
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="diagnostic_tools"
>3.3.1.1. Diagnostic Tools</A
></H3
><P
>The <B
CLASS="command"
>dig</B
>, <B
CLASS="command"
>host</B
>, and
<B
CLASS="command"
>nslookup</B
> programs are all command line tools
for manually querying name servers.  They differ in style and
output format.
</P
><P
></P
><DIV
CLASS="variablelist"
><DL
><DT
><B
CLASS="command"
>dig</B
></DT
><DD
><P
>The domain information groper (<B
CLASS="command"
>dig</B
>)
is the most versatile and complete of these lookup tools.
It has two modes: simple interactive
mode for a single query, and batch mode which executes a query for
each in a list of several query lines. All query options are accessible
from the command line.</P
><P
><B
CLASS="command"
>dig</B
>  [@<VAR
CLASS="replaceable"
>server</VAR
>]  <VAR
CLASS="replaceable"
>domain</VAR
>  [<VAR
CLASS="replaceable"
>query-type</VAR
>] [<VAR
CLASS="replaceable"
>query-class</VAR
>] [+<VAR
CLASS="replaceable"
>query-option</VAR
>] [-<VAR
CLASS="replaceable"
>dig-option</VAR
>] [%<VAR
CLASS="replaceable"
>comment</VAR
>]</P
><P
>The usual simple use of dig will take the form</P
><P
><B
CLASS="command"
>dig @server domain query-type query-class</B
></P
><P
>For more information and a list of available commands and
options, see the <B
CLASS="command"
>dig</B
> man page.</P
></DD
><DT
><B
CLASS="command"
>host</B
></DT
><DD
><P
>The <B
CLASS="command"
>host</B
> utility emphasizes simplicity
and ease of use.  By default, it converts
between host names and Internet addresses, but its functionality
can be extended with the use of options.</P
><P
><B
CLASS="command"
>host</B
>  [-aCdlrTwv] [-c <VAR
CLASS="replaceable"
>class</VAR
>] [-N <VAR
CLASS="replaceable"
>ndots</VAR
>] [-t <VAR
CLASS="replaceable"
>type</VAR
>] [-W <VAR
CLASS="replaceable"
>timeout</VAR
>] [-R <VAR
CLASS="replaceable"
>retries</VAR
>]  <VAR
CLASS="replaceable"
>hostname</VAR
>  [<VAR
CLASS="replaceable"
>server</VAR
>]</P
><P
>For more information and a list of available commands and
options, see the <B
CLASS="command"
>host</B
> man page.</P
></DD
><DT
><B
CLASS="command"
>nslookup</B
></DT
><DD
><P
><B
CLASS="command"
>nslookup</B
> has two modes: interactive
and non-interactive. Interactive mode allows the user to query name servers
for information about various hosts and domains or to print a list
of hosts in a domain. Non-interactive mode is used to print just
the name and requested information for a host or domain.</P
><P
><B
CLASS="command"
>nslookup</B
>  [-option...] [<VAR
CLASS="replaceable"
>host-to-find</VAR
> | -  [server]]</P
><P
>Interactive mode is entered when no arguments are given (the
default name server will be used) or when the first argument is a
hyphen (`-') and the second argument is the host name or Internet address
of a name server.</P
><P
>Non-interactive mode is used when the name or Internet address
of the host to be looked up is given as the first argument. The
optional second argument specifies the host name or address of a name server.</P
><P
>Due to its arcane user interface and frequently inconsistent
behavior, we do not recommend the use of <B
CLASS="command"
>nslookup</B
>.
Use <B
CLASS="command"
>dig</B
> instead.</P
></DD
></DL
></DIV
></DIV
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="admin_tools"
>3.3.1.2. Administrative Tools</A
></H3
><P
>Administrative tools play an integral part in the management
of a server.</P
><P
></P
><DIV
CLASS="variablelist"
><DL
><DT
><A
NAME="named-checkconf"
></A
><B
CLASS="command"
>named-checkconf</B
></DT
><DD
><P
>The <B
CLASS="command"
>named-checkconf</B
> program
              checks the syntax of a <TT
CLASS="filename"
>named.conf</TT
> file.</P
><P
><B
CLASS="command"
>named-checkconf</B
>  [-t <VAR
CLASS="replaceable"
>directory</VAR
>] [<VAR
CLASS="replaceable"
>filename</VAR
>]</P
></DD
><DT
><A
NAME="named-checkzone"
></A
><B
CLASS="command"
>named-checkzone</B
></DT
><DD
><P
>The <B
CLASS="command"
>named-checkzone</B
> program checks a master file for
              syntax and consistency.</P
><P
><B
CLASS="command"
>named-checkzone</B
>  [-djqvD] [-c <VAR
CLASS="replaceable"
>class</VAR
>] [-o <VAR
CLASS="replaceable"
>output</VAR
>] [-t <VAR
CLASS="replaceable"
>directory</VAR
>] [-w <VAR
CLASS="replaceable"
>directory</VAR
>] [-k <VAR
CLASS="replaceable"
>(ignore|warn|fail)</VAR
>] [-n <VAR
CLASS="replaceable"
>(ignore|warn|fail)</VAR
>]  <VAR
CLASS="replaceable"
>zone</VAR
>  [<VAR
CLASS="replaceable"
>filename</VAR
>]</P
></DD
><DT
><A
NAME="rndc"
></A
><B
CLASS="command"
>rndc</B
></DT
><DD
><P
>The remote name daemon control
              (<B
CLASS="command"
>rndc</B
>) program allows the system
              administrator to control the operation of a name server.
              If you run <B
CLASS="command"
>rndc</B
> without any options
              it will display a usage message as follows:</P
><P
><B
CLASS="command"
>rndc</B
>  [-c <VAR
CLASS="replaceable"
>config</VAR
>] [-s <VAR
CLASS="replaceable"
>server</VAR
>] [-p <VAR
CLASS="replaceable"
>port</VAR
>] [-y <VAR
CLASS="replaceable"
>key</VAR
>]  <VAR
CLASS="replaceable"
>command</VAR
>  [<VAR
CLASS="replaceable"
>command</VAR
>...]</P
><P
><B
CLASS="command"
>command</B
> is one of the following:</P
><P
></P
><DIV
CLASS="variablelist"
><DL
><DT
><KBD
CLASS="userinput"
>reload</KBD
></DT
><DD
><P
>Reload configuration file and zones.</P
></DD
><DT
><KBD
CLASS="userinput"
>reload <VAR
CLASS="replaceable"
>zone</VAR
>
       [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>class</VAR
>
           [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>view</VAR
></SPAN
>]</SPAN
>]</KBD
></DT
><DD
><P
>Reload the given zone.</P
></DD
><DT
><KBD
CLASS="userinput"
>refresh <VAR
CLASS="replaceable"
>zone</VAR
>
       [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>class</VAR
>
           [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>view</VAR
></SPAN
>]</SPAN
>]</KBD
></DT
><DD
><P
>Schedule zone maintenance for the given zone.</P
></DD
><DT
><KBD
CLASS="userinput"
>retransfer <VAR
CLASS="replaceable"
>zone</VAR
>
       [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>class</VAR
>
           [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>view</VAR
></SPAN
>]</SPAN
>]</KBD
></DT
><DD
><P
>Retransfer the given zone from the master.</P
></DD
><DT
><KBD
CLASS="userinput"
>freeze <VAR
CLASS="replaceable"
>zone</VAR
>
       [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>class</VAR
>
           [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>view</VAR
></SPAN
>]</SPAN
>]</KBD
></DT
><DD
><P
>Suspend updates to a dynamic zone.  This allows manual
    edits to be made to a zone normally updated by dynamic update.  It
    also causes changes in the journal file to be synced into the master
    and the journal file to be removed.  All dynamic update attempts will
    be refused while the zone is frozen.</P
></DD
><DT
><KBD
CLASS="userinput"
>unfreeze <VAR
CLASS="replaceable"
>zone</VAR
>
       [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>class</VAR
>
           [<SPAN
CLASS="optional"
><VAR
CLASS="replaceable"
>view</VAR
></SPAN
>]</SPAN
>]</KBD
></DT
><DD
><P
>Enable updates to a frozen dynamic zone.  This causes
    the server to reload the zone from disk, and re-enables dynamic updates
    after the load has completed.  After a zone is unfrozen, dynamic updates
    will no longer be refused.</P
></DD
><DT
><KBD
CLASS="userinput"
>reconfig</KBD
></DT
><DD
><P
>Reload the configuration file and load new zones,
   but do not reload existing zone files even if they have changed.
   This is faster than a full <B
CLASS="command"
>reload</B
> when there
   is a large number of zones because it avoids the need to examine the
   modification times of the zones files.
   </P
></DD
><DT
><KBD
CLASS="userinput"
>stats</KBD
></DT
><DD
><P
>Write server statistics to the statistics file.</P
></DD
><DT
><KBD
CLASS="userinput"
>querylog</KBD
></DT
><DD
><P
>Toggle query logging. Query logging can also be enabled
   by explicitly directing the <B
CLASS="command"
>queries</B
>
   <B
CLASS="command"
>category</B
> to a <B
CLASS="command"
>channel</B
> in the
   <B
CLASS="command"
>logging</B
> section of
   <TT
CLASS="filename"
>named.conf</TT
>.</P
></DD
><DT
><KBD
CLASS="userinput"
>dumpdb</KBD
></DT
><DD
><P
>Dump the server's caches to the dump file. </P
></DD
><DT
><KBD
CLASS="userinput"
>stop</KBD
></DT
><DD
><P
>Stop the server,
   making sure any recent changes
   made through dynamic update or IXFR are first saved to the master files
   of the updated zones.</P
></DD
><DT
><KBD
CLASS="userinput"
>halt</KBD
></DT
><DD
><P
>Stop the server immediately.  Recent changes
   made through dynamic update or IXFR are not saved to the master files,
   but will be rolled forward from the journal files when the server
   is restarted.</P
></DD
><DT
><KBD
CLASS="userinput"
>trace</KBD
></DT
><DD
><P
>Increment the servers debugging level by one. </P
></DD
><DT
><KBD
CLASS="userinput"
>trace <VAR
CLASS="replaceable"
>level</VAR
></KBD
></DT
><DD
><P
>Sets the server's debugging level to an explicit
   value.</P
></DD
><DT
><KBD
CLASS="userinput"
>notrace</KBD
></DT
><DD
><P
>Sets the server's debugging level to 0.</P
></DD
><DT
><KBD
CLASS="userinput"
>flush</KBD
></DT
><DD
><P
>Flushes the server's cache.</P
></DD
><DT
><KBD
CLASS="userinput"
>status</KBD
></DT
><DD
><P
>Display status of the server.
Note the number of zones includes the internal <B
CLASS="command"
>bind/CH</B
> zone
and the default <B
CLASS="command"
>./IN</B
> hint zone if there is not a
explicit root zone configured.</P
></DD
></DL
></DIV
><P
>In <ACRONYM
CLASS="acronym"
>BIND</ACRONYM
> 9.2, <B
CLASS="command"
>rndc</B
>
supports all the commands of the BIND 8 <B
CLASS="command"
>ndc</B
>
utility except <B
CLASS="command"
>ndc start</B
> and
<B
CLASS="command"
>ndc restart</B
>, which were also
not supported in <B
CLASS="command"
>ndc</B
>'s channel mode.</P
><P
>A configuration file is required, since all
communication with the server is authenticated with
digital signatures that rely on a shared secret, and
there is no way to provide that secret other than with a
configuration file.  The default location for the
<B
CLASS="command"
>rndc</B
> configuration file is
<TT
CLASS="filename"
>/etc/rndc.conf</TT
>, but an alternate
location can be specified with the <VAR
CLASS="option"
>-c</VAR
>
option.  If the configuration file is not found,
<B
CLASS="command"
>rndc</B
> will also look in
<TT
CLASS="filename"
>/etc/rndc.key</TT
> (or whatever
<VAR
CLASS="varname"
>sysconfdir</VAR
> was defined when
the <ACRONYM
CLASS="acronym"
>BIND</ACRONYM
> build was configured).
The <TT
CLASS="filename"
>rndc.key</TT
> file is generated by
running <B
CLASS="command"
>rndc-confgen -a</B
> as described in
<A
HREF="Bv9ARM.ch06.html#controls_statement_definition_and_usage"
>Section 6.2.4</A
>.</P
><P
>The format of the configuration file is similar to
that of <TT
CLASS="filename"
>named.conf</TT
>, but limited to
only four statements, the <B
CLASS="command"
>options</B
>,
<B
CLASS="command"
>key</B
>, <B
CLASS="command"
>server</B
> and
<B
CLASS="command"
>include</B
>
statements.  These statements are what associate the
secret keys to the servers with which they are meant to
be shared.  The order of statements is not
significant.</P
><P
>The <B
CLASS="command"
>options</B
> statement has three clauses:
<B
CLASS="command"
>default-server</B
>, <B
CLASS="command"
>default-key</B
>, 
and <B
CLASS="command"
>default-port</B
>.
<B
CLASS="command"
>default-server</B
> takes a
host name or address argument  and represents the server that will
be contacted if no <VAR
CLASS="option"
>-s</VAR
>
option is provided on the command line.  
<B
CLASS="command"
>default-key</B
> takes
the name of a key as its argument, as defined by a <B
CLASS="command"
>key</B
> statement.
<B
CLASS="command"
>default-port</B
> specifies the port to which
<B
CLASS="command"
>rndc</B
> should connect if no
port is given on the command line or in a
<B
CLASS="command"
>server</B
> statement.</P
><P
>The <B
CLASS="command"
>key</B
> statement defines an key to be used
by <B
CLASS="command"
>rndc</B
> when authenticating with
<B
CLASS="command"
>named</B
>.  Its syntax is identical to the
<B
CLASS="command"
>key</B
> statement in named.conf.
The keyword <KBD
CLASS="userinput"
>key</KBD
> is
followed by a key name, which must be a valid
domain name, though it need not actually be hierarchical; thus,
a string like "<KBD
CLASS="userinput"
>rndc_key</KBD
>" is a valid name.
The <B
CLASS="command"
>key</B
> statement has two clauses:
<B
CLASS="command"
>algorithm</B
> and <B
CLASS="command"
>secret</B
>.
While the configuration parser will accept any string as the argument
to algorithm, currently only the string "<KBD
CLASS="userinput"
>hmac-md5</KBD
>"
has any meaning.  The secret is a base-64 encoded string.</P
><P
>The <B
CLASS="command"
>server</B
> statement associates a key
defined using the <B
CLASS="command"
>key</B
> statement with a server.
The keyword <KBD
CLASS="userinput"
>server</KBD
> is followed by a
host name or address.  The <B
CLASS="command"
>server</B
> statement
has two clauses: <B
CLASS="command"
>key</B
> and <B
CLASS="command"
>port</B
>.
The <B
CLASS="command"
>key</B
> clause specifies the name of the key
to be used when communicating with this server, and the
<B
CLASS="command"
>port</B
> clause can be used to
specify the port <B
CLASS="command"
>rndc</B
> should connect
to on the server.</P
><P
>A sample minimal configuration file is as follows:</P
><PRE
CLASS="programlisting"
>&#13;key rndc_key {
     algorithm "hmac-md5";
     secret "c3Ryb25nIGVub3VnaCBmb3IgYSBtYW4gYnV0IG1hZGUgZm9yIGEgd29tYW4K";
};
options {
     default-server 127.0.0.1;
     default-key    rndc_key;
};
</PRE
><P
>This file, if installed as <TT
CLASS="filename"
>/etc/rndc.conf</TT
>,
would allow the command:</P
><P
><SAMP
CLASS="prompt"
>$ </SAMP
><KBD
CLASS="userinput"
>rndc reload</KBD
></P
><P
>to connect to 127.0.0.1 port 953 and cause the name server
to reload, if a name server on the local machine were running with
following controls statements:</P
><PRE
CLASS="programlisting"
>&#13;controls {
        inet 127.0.0.1 allow { localhost; } keys { rndc_key; };
};
</PRE
><P
>and it had an identical key statement for
<VAR
CLASS="literal"
>rndc_key</VAR
>.</P
><P
>Running the <B
CLASS="command"
>rndc-confgen</B
> program will
conveniently create a <TT
CLASS="filename"
>rndc.conf</TT
>
file for you, and also display the
corresponding <B
CLASS="command"
>controls</B
> statement that you need to
add to <TT
CLASS="filename"
>named.conf</TT
>.  Alternatively,
you can run <B
CLASS="command"
>rndc-confgen -a</B
> to set up
a <TT
CLASS="filename"
>rndc.key</TT
> file and not modify 
<TT
CLASS="filename"
>named.conf</TT
> at all.
</P
></DD
></DL
></DIV
></DIV
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="AEN689"
>3.3.2. Signals</A
></H2
><P
>Certain UNIX signals cause the name server to take specific
actions, as described in the following table.  These signals can
be sent using the <B
CLASS="command"
>kill</B
> command.</P
><DIV
CLASS="informaltable"
><P
></P
><A
NAME="AEN693"
></A
><TABLE
CELLPADDING="3"
BORDER="1"
CLASS="CALSTABLE"
><TBODY
><TR
><TD
><P
><B
CLASS="command"
>SIGHUP</B
></P
></TD
><TD
><P
>Causes the server to read <TT
CLASS="filename"
>named.conf</TT
> and
reload the database. </P
></TD
></TR
><TR
><TD
><P
><B
CLASS="command"
>SIGTERM</B
></P
></TD
><TD
><P
>Causes the server to clean up and exit.</P
></TD
></TR
><TR
><TD
>&#13;<P
><B
CLASS="command"
>SIGINT</B
></P
>
</TD
><TD
><P
>Causes the server to clean up and exit.</P
></TD
></TR
></TBODY
></TABLE
><P
></P
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="Bv9ARM.ch02.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="Bv9ARM.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="Bv9ARM.ch04.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><ACRONYM
CLASS="acronym"
>BIND</ACRONYM
> Resource Requirements</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Advanced DNS Features</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>