MidnightBSD/src/sbin/prowld/prowld.conf.5
.\" Copyright (c) 2026 Lucas Holt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 19, 2026
.Dt PROWLD.CONF 5
.Os
.Sh NAME
.Nm prowld.conf
.Nd prowld daemon configuration file
.Sh DESCRIPTION
The
.Pa prowld.conf
file contains global configuration settings for the
.Xr prowld 8
service management daemon.
It is parsed by
.Xr libucl 3
and accepts UCL or JSON syntax.
.Pp
The file is typically located at
.Pa /etc/prowld/prowld.conf .
It must be owned by root and must not be world-writable;
otherwise
.Xr prowld 8
will ignore it and log a warning.
.Sh SCHEMA
The following keys are recognised at the top level of the configuration:
.Bl -tag -width "max_concurrent_starts"
.It Va max_concurrent_starts
Maximum number of jobs that may be simultaneously transitioning to the
.Cm starting
state.
Accepts an integer greater than or equal to zero, or the string
.Dq auto .
Zero and
.Dq auto
both select the default of
.Va ncpu * 2 ,
with a minimum of 4.
This limits parallelism during the initial startup wave and subsequent
dependency triggers, preventing resource exhaustion.
.It Va shutdown_timeout
System-wide budget in seconds for an orderly shutdown.
During a graceful stop,
.Xr prowld 8
waits for services marked with
.Va shutdown_wait: true
to exit, up to this total limit.
Default: 300.
.It Va debug
Boolean.
If true, enables verbose logging to standard error in addition to
.Xr syslog 3 .
The command-line
.Fl d
flag always takes precedence over this setting.
Default: false.
.El
.Sh FILES
.Bl -tag -width "/etc/prowld/prowld.conf" -compact
.It Pa /etc/prowld/prowld.conf
The default configuration file path.
.It Pa /etc/prowld/prowld.conf.sample
A sample configuration file showing default values.
.El
.Sh EXAMPLES
A typical configuration using UCL syntax:
.Bd -literal -offset indent
max_concurrent_starts = auto
shutdown_timeout = 120
debug = false
.Ed
.Sh SEE ALSO
.Xr libucl 3 ,
.Xr prowld 8 ,
.Xr prowl-unit 5
.Sh HISTORY
.Nm
first appeared in MidnightBSD 4.1.
.Sh AUTHORS
.An Lucas Holt Aq Mt luke@MidnightBSD.org
