MidnightBSD/src/usr.sbin/kernbb/kernbb.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: release/7.0.0/usr.sbin/kernbb/kernbb.8 133249 2004-08-07 04:28:56Z imp $
.\"
.Dd May 22, 1995
.Dt KERNBB 8
.Os
.Sh NAME
.Nm kernbb
.Nd generate a dump of the kernels basic-block profile buffers
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
utility is used to extract the basic-block profiling buffers of the running
kernel into the files needed for the
.Xr gcov 1
tool.
.Pp
At least one source file in the running kernel must have been compiled
with the
.Fl Fl test-coverage
and
.Fl Fl profile-arcs
options.
.Pp
The output is stored in the filenames compiled into the kernel by
.Xr gcc 1 .
If the absolute pathname cannot be written to, the directory part
of the filename is discarded and the file stored in the current
directory under its basename.
.Pp
The output files are named
.Pa *.da ,
and the
.Xr gcov 1
program will extract the counts and merge them with the source
file to show actual execution counts.
.Sh FILES
.Bl -tag -width /boot/kernel/kernel -compact
.It Pa /boot/kernel/kernel
the default system
.It Pa /dev/kmem
the default memory
.El
.Sh SEE ALSO
.Xr cc 1 ,
.Xr gcov 1
.Sh AUTHORS
The
.Nm
utility was written by
.An Poul-Henning Kamp ,
along with the kernel-support.
.Sh BUGS
There are far too much magic and internal knowledge from GCC in this.
