MidnightBSD/src/share/man/man4/atlantic.4
.\" Copyright (c) 2024 Lucas Holt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright notice,
.\"    this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
.\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" * Other names and brands may be claimed as the property of others.
.\"
.Dd June 11, 2026
.Dt ATLANTIC 4
.Os
.Sh NAME
.Nm atlantic
.Nd Aquantia and Marvell AQtion multigigabit Ethernet adapter driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device atlantic"
.Ed
.Pp
To load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_atlantic_load="YES"
.Ed
.Pp
The
.Nm
driver is included in the
.Dv GENERIC
kernel on
.Dv amd64 .
.Sh DESCRIPTION
The
.Nm
driver supports Aquantia and Marvell AQtion PCI Express multigigabit
Ethernet adapters, including Atlantic and Atlantic 2 devices.
.Sh HARDWARE
The
.Nm
driver supports adapters at speeds of
10M, 100M, 1G, 2.5G, 5G, and 10G, depending on the controller.
.Pp
Supported controllers include:
.Pp
.Bl -bullet -compact
.It
Aquantia AQC100, AQC100S, AQC107, AQC107S, AQC108, AQC108S,
AQC109, AQC109S, AQC111, AQC111S, AQC112, and AQC112S
.It
Marvell/Aquantia AQC113, AQC113C, AQC113CA, AQC113CS, AQC114CS,
AQC115C, and AQC116C
.El
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Pp
The driver uses the
.Xr firmware 9
framework for adapters that require host-provided firmware.
.Sh SUPPORT
For general information and support,
go to the aQuantia support website at:
.Pa https://www.marvell.com/
and
.Pa https://github.com/Aquantia/aqtion-freebsd .
.Sh SEE ALSO
.Xr altq 4 ,
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ng_ether 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Mx 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Aquantia .
