MidnightBSD/src/share/man/man9/BUS_CHILD_DELETED.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2012 Hudson River Trading LLC
.\" Written by: John H. Baldwin <jhb@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: stable/11/share/man/man9/BUS_CHILD_DELETED.9 281887 2015-04-23 14:22:20Z jhb $
.\"
.Dd August 21, 2012
.Dt BUS_CHILD_DELETED 9
.Os
.Sh NAME
.Nm BUS_CHILD_DELETED
.Nd "notify a bus device that a child is being deleted"
.Sh SYNOPSIS
.In sys/param.h
.In sys/bus.h
.Ft void
.Fn BUS_CHILD_DELETED "device_t dev" "device_t child"
.Sh DESCRIPTION
The
.Fn BUS_CHILD_DELETED
method is invoked by the new-bus framework when a device is deleted.
A bus driver can provide an implementation of this method to
release bus-specific resources associated with a device such as
instance variables.
.Sh SEE ALSO
.Xr BUS_ADD_CHILD 9 ,
.Xr device 9
.Sh HISTORY
The
.Fn BUS_CHILD_DELETED
method first appeared in
.Fx 10.0 .
