MidnightBSD/src/share/man/man9/fdclone.9
.\" Copyright (c) 2009 Lucas Holt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $MidnightBSD$
.\"
.Dd December 12, 2009
.Dt FDCLONE 9
.Os
.Sh NAME
.Nm fdclone
.Nd clone on open
.Sh SYNOPSIS
.In sys/conf.h
.Ft int
.Fn fdclone "struct cdevsw *csw" "struct file *fp" "int fmode" "struct cdev **clone" "void *si_drv1" "struct thread *td"
.Sh DESCRIPTION
The
.Fn fdclone
function is used to provide cloning on
.Xr open 2
within driver implementations. This can be used to provide per 
file descriptor private data. A cdevsw master and a separate
cdevsw will be used for clones, and must be provided by the
caller. All calls on the fp are dispatched to the clone
and si_drv1 can be used by the clones to find the master.
.Sh RETURN VALUES
The
.Fn fdclone
function returns zero on success or an error code.
.Sh EXAMPLES
.Bd -literal -offset indent
int
sample_use(struct cdev *dev, int oflags, struct thread *td, 
  	   struct file *fp)
{
        struct cdev *clone;
        int res;

        res = fdclone(&fclone_cdevsw, fp, oflags, &clone, dev, td);
        return (res);
}

.Ed
.Sh HISTORY
The
.Nm
function was introduced in
.Mx 0.3 .
The implementation was written by Kostik Belousov
with help from Peter Holm for
.Fx 7.0 ,
but never committed.
