MidnightBSD/src/share/man/man9/vm_page_flag.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD: release/7.0.0/share/man/man9/vm_page_flag.9 147647 2005-06-28 20:15:19Z hmp $
.\"
.Dd July 14, 2001
.Dt VM_PAGE_FLAG 9
.Os
.Sh NAME
.Nm vm_page_flag_clear , vm_page_flag_set
.Nd "change page flags"
.Sh SYNOPSIS
.In sys/param.h
.In vm/vm.h
.In vm/vm_page.h
.Ft void
.Fn vm_page_flag_clear "vm_page_t m" "unsigned short bits"
.Ft void
.Fn vm_page_flag_set "vm_page_t m" "unsigned short bits"
.Sh DESCRIPTION
The
.Fn vm_page_flag_clear
atomically clears the specified bits on the page's flags.
.Pp
The
.Fn vm_page_flag_set
atomically sets the specified bits on the page's flags.
.Pp
The functions arguments are:
.Bl -tag -width ".Fa bits"
.It Fa m
The page whose flags are updated.
.It Fa bits
The bits that are set or cleared on the page's flags.
.El
.Sh AUTHORS
This manual page was written by
.An Chad David Aq davidc@acns.ab.ca .
